; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	thermograph2 - mode
	GroundStation3 - direction
	Star2 - direction
	Star1 - direction
	Star0 - direction
	Phenomenon4 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 114)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon4)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 106)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star1)
	(supports instrument5 thermograph1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star0)
	(supports instrument6 thermograph2)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 143)
	(= (data Phenomenon4 thermograph1) 278)
	(= (data Star5 thermograph1) 178)
	(= (data Star6 thermograph1) 73)
	(= (data Planet7 thermograph1) 131)
	(= (data Phenomenon4 spectrograph0) 263)
	(= (data Star5 spectrograph0) 140)
	(= (data Star6 spectrograph0) 165)
	(= (data Planet7 spectrograph0) 253)
	(= (data Phenomenon4 thermograph2) 260)
	(= (data Star5 thermograph2) 258)
	(= (data Star6 thermograph2) 124)
	(= (data Planet7 thermograph2) 244)
	(= (slew_time GroundStation3 Star0) 33.71)
	(= (slew_time Star0 GroundStation3) 33.71)
	(= (slew_time GroundStation3 Star1) 49.46)
	(= (slew_time Star1 GroundStation3) 49.46)
	(= (slew_time GroundStation3 Star2) 56.06)
	(= (slew_time Star2 GroundStation3) 56.06)
	(= (slew_time Star2 Star0) 17.68)
	(= (slew_time Star0 Star2) 17.68)
	(= (slew_time Star2 Star1) 33.25)
	(= (slew_time Star1 Star2) 33.25)
	(= (slew_time Star1 Star0) 11.06)
	(= (slew_time Star0 Star1) 11.06)
	(= (slew_time Phenomenon4 Star0) 27.64)
	(= (slew_time Star0 Phenomenon4) 27.64)
	(= (slew_time Phenomenon4 Star1) 35.15)
	(= (slew_time Star1 Phenomenon4) 35.15)
	(= (slew_time Phenomenon4 Star2) 88.94)
	(= (slew_time Star2 Phenomenon4) 88.94)
	(= (slew_time Phenomenon4 GroundStation3) 36.02)
	(= (slew_time GroundStation3 Phenomenon4) 36.02)
	(= (slew_time Star5 Star0) 8.091)
	(= (slew_time Star0 Star5) 8.091)
	(= (slew_time Star5 Star1) 25.54)
	(= (slew_time Star1 Star5) 25.54)
	(= (slew_time Star5 Star2) 34.66)
	(= (slew_time Star2 Star5) 34.66)
	(= (slew_time Star5 GroundStation3) 20.15)
	(= (slew_time GroundStation3 Star5) 20.15)
	(= (slew_time Star5 Phenomenon4) 32.62)
	(= (slew_time Phenomenon4 Star5) 32.62)
	(= (slew_time Star6 Star0) 31.16)
	(= (slew_time Star0 Star6) 31.16)
	(= (slew_time Star6 Star1) 0.8973)
	(= (slew_time Star1 Star6) 0.8973)
	(= (slew_time Star6 Star2) 35.43)
	(= (slew_time Star2 Star6) 35.43)
	(= (slew_time Star6 GroundStation3) 47.79)
	(= (slew_time GroundStation3 Star6) 47.79)
	(= (slew_time Star6 Phenomenon4) 49.61)
	(= (slew_time Phenomenon4 Star6) 49.61)
	(= (slew_time Star6 Star5) 2.641)
	(= (slew_time Star5 Star6) 2.641)
	(= (slew_time Planet7 Star0) 10.05)
	(= (slew_time Star0 Planet7) 10.05)
	(= (slew_time Planet7 Star1) 35.48)
	(= (slew_time Star1 Planet7) 35.48)
	(= (slew_time Planet7 Star2) 23.49)
	(= (slew_time Star2 Planet7) 23.49)
	(= (slew_time Planet7 GroundStation3) 25.83)
	(= (slew_time GroundStation3 Planet7) 25.83)
	(= (slew_time Planet7 Phenomenon4) 22.72)
	(= (slew_time Phenomenon4 Planet7) 22.72)
	(= (slew_time Planet7 Star5) 75.36)
	(= (slew_time Star5 Planet7) 75.36)
	(= (slew_time Planet7 Star6) 69.6)
	(= (slew_time Star6 Planet7) 69.6)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star0)
	(have_image Phenomenon4 spectrograph0)
	(have_image Star5 thermograph2)
	(have_image Star6 spectrograph0)
	(have_image Planet7 thermograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 planet7 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 143 to 67.64, (fuel-used) from 0 to 75.36
   goals met: 0 of 5
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 5
3. (turn_to satellite2 phenomenon4 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 67.64 to 44.92, (fuel-used) from 75.36 to 98.08
   goals met: 0 of 5
4. (turn_to satellite0 star5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 114 to 38.64, (fuel-used) from 98.08 to 173.44
   goals met: 0 of 5
5. (turn_to satellite0 star0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 38.64 to 30.549, (fuel-used) from 173.44 to 181.531
   goals met: 1 of 5
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
7. (turn_to satellite0 star5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 30.549 to 22.458, (fuel-used) from 181.531 to 189.622
   goals met: 0 of 5
8. (turn_to satellite2 star0 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 44.92 to 17.28, (fuel-used) from 189.622 to 217.262
   goals met: 0 of 5
9. (turn_to satellite0 star0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 22.458 to 14.367, (fuel-used) from 217.262 to 225.353
   goals met: 1 of 5
10. (turn_to satellite1 star1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 106 to 70.85, (fuel-used) from 225.353 to 260.503
   goals met: 1 of 5
11. (turn_to satellite1 star5 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 70.85 to 45.31, (fuel-used) from 260.503 to 286.043
   goals met: 1 of 5
12. (switch_off instrument6 satellite2)
   deleted: (power_on instrument6)
   added: (power_avail satellite2)
   goals met: 1 of 5
13. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 5
14. (calibrate satellite2 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 1 of 5
15. (turn_to satellite2 planet7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 17.28 to 7.23, (fuel-used) from 286.043 to 296.093
   goals met: 1 of 5
16. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 5
17. (turn_to satellite1 star6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 45.31 to 42.669, (fuel-used) from 296.093 to 298.734
   goals met: 1 of 5
18. (turn_to satellite1 star1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 42.669 to 41.7717, (fuel-used) from 298.734 to 299.631
   goals met: 1 of 5
19. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 1 of 5
20. (turn_to satellite1 star6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 41.7717 to 40.8744, (fuel-used) from 299.631 to 300.529
   goals met: 1 of 5
21. (take_image satellite1 star6 instrument3 spectrograph0)
   added: (have_image star6 spectrograph0)
   changed: (data_capacity satellite1) from 1000 to 835, (data-stored) from 0 to 165
   goals met: 2 of 5
22. (turn_to satellite1 star5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 40.8744 to 38.2334, (fuel-used) from 300.529 to 303.17
   goals met: 2 of 5
23. (take_image satellite1 star5 instrument3 thermograph2)
   added: (have_image star5 thermograph2)
   changed: (data_capacity satellite1) from 835 to 577, (data-stored) from 165 to 423
   goals met: 3 of 5
24. (turn_to satellite1 phenomenon4 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 38.2334 to 5.6134, (fuel-used) from 303.17 to 335.79
   goals met: 3 of 5
25. (take_image satellite2 planet7 instrument5 thermograph1)
   added: (have_image planet7 thermograph1)
   changed: (data_capacity satellite2) from 1000 to 869, (data-stored) from 423 to 554
   goals met: 4 of 5
26. (take_image satellite1 phenomenon4 instrument3 spectrograph0)
   added: (have_image phenomenon4 spectrograph0)
   changed: (data_capacity satellite1) from 577 to 314, (data-stored) from 554 to 817
   goals met: 5 of 5
